Magnetoresistance/esp8266-ai/firmware/src/main.cpp
StockRow stocks[MAX_STOCKS];
int stockCount = 0;
bool stockEverLoaded = false;
bool stockDirty = false;
bool stockChromeDrawn = false;
String stockLastCode[MAX_STOCKS]; // top line (code + CJK name strip)
String stockLastVal[MAX_STOCKS];  // value line (price + pct)
unsigned long lastStockPollMs = 0;
// CJK names come as Mac-rendered RGB565 strips (GET /stock/names.raw, one
// 156x16 strip per row) - names_rev says when to re-fetch. -1 = not drawn.
const int STOCK_NAME_W = 156, STOCK_NAME_H = 16;
int stockNamesRev = -1;
int stockNamesDrawnRev = -1;

String musicTitle, musicArtist, musicAlbum;
bool musicPlaying = false;
int musicElapsed = 0, musicDuration = 0;
int musicArtworkRev = -1;
int musicTextRev = -1;
bool musicHasArtwork = false;
bool musicChromeDrawn = false;
unsigned long lastMusicPollMs = 0;

int claudeFrame = 0;
int codexFrame = 0;
unsigned long lastAnimMs = 0;

bool flashOn = true;
unsigned long lastFlashMs = 0;

// Bridge host is not asked for during first-time WiFi setup: the Mac/Windows
// bridge discovers the device and pairs automatically (or set via /api/bridge).
String bridgeHost;

struct ClaudeStatus {
  String status = "unknown";
  long tokensToday = 0;
  int sessionMin = 0;
  int sessionWindowMin = 300;
  float fiveHourPct = -1; // real OAuth quota from the bridge, -1 = unknown
  int fiveHourResetMin = -1; // minutes until the 5h window resets
  float sevenDayPct = -1;
  int sevenDayResetMin = -1; // minutes until the 7-day window resets
  bool needsInput = false; // waiting on a permission/approval prompt
};

struct CodexStatus {
  String status = "unknown";
  long tokensToday = 0;
  float primaryPct = -1;
  int primaryResetMin = -1;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
  bool needsInput = false;
};

ClaudeStatus claudeStatus;
CodexStatus codexStatus;

unsigned long lastPollMs = 0;
unsigned long lastSuccessMs = 0;
bool everPolled = false;
bool mainUiShown = false;      // false while the config-portal screen is up
bool webServerStarted = false; // deferred: port 80 clashes with the portal

// ---------- backlight brightness ----------
// The panel backlight (TFT_BL, active LOW) is PWM-dimmable — the vendor's own
// firmware does the same. 0 = off, 100 = full. Persisted so it survives reboot.

int brightness = BRIGHTNESS_DEFAULT; // 0-100
bool brightnessInvert = false; // when true, PWM is inverted (for active-HIGH backlight panels wired opposite)
int displayRotation = DISPLAY_ROTATION_DEFAULT; // 0-7

void applyBrightness() {
  // TFT_BACKLIGHT_ON controls default polarity (set in platformio.ini):
  //   HIGH = active HIGH (pin HIGH = backlight on)
  //   LOW  = active LOW  (pin LOW  = backlight on)
  // brightnessInvert manually toggles the formula so users whose panel is
  // wired opposite can fix it without recompiling.
  // analogWrite() duty: 0 = always LOW, range = always HIGH.
#if TFT_BACKLIGHT_ON == HIGH
  bool normal = !brightnessInvert;
#else
  bool normal = brightnessInvert;
#endif
  if (normal) {
    // Active HIGH: higher duty = brighter
    analogWrite(TFT_BL, brightness);
  } else {
    // Active LOW: lower duty = brighter (inverted)
    analogWrite(TFT_BL, 100 - brightness);
  }
}

void loadBrightness() {
  if (!LittleFS.exists(BRIGHTNESS_FILE)) return;
  File f = LittleFS.open(BRIGHTNESS_FILE, "r");
  if (!f) return;
  int v = f.readStringUntil('\n').toInt();
  f.close();
  if (v >= 0 && v <= 100) brightness = v;
}

void saveBrightness() {
  File f = LittleFS.open(BRIGHTNESS_FILE, "w");
  if (!f) return;
  f.println(brightness);
  f.close();
}

// ---------- backlight polarity invert (for panels wired opposite) ----------

void loadBrightnessInvert() {
  if (!LittleFS.exists(BRIGHTNESS_INVERT_FILE)) return;
  File f = LittleFS.open(BRIGHTNESS_INVERT_FILE, "r");
  if (!f) return;
  int v = f.readStringUntil('\n').toInt();
  f.close();
  brightnessInvert = (v != 0);
}

void saveBrightnessInvert() {
  File f = LittleFS.open(BRIGHTNESS_INVERT_FILE, "w");
  if (!f) return;
  f.println(brightnessInvert ? 1 : 0);
  f.close();
}

// ---------- display rotation / mirror ----------

void applyDisplayRotation() {
  // Always call setRotation() first so TFT_eSPI's internal state (_width,
  // _height, addressing) stays consistent with the base orientation.
  int baseRot = displayRotation & 3;
  tft.setRotation(baseRot);

  // GC9107 is a 128x160 GRAM chip but this 0.85" panel only exposes 128x128
  // of it, at an offset inside the GRAM (Wisevision N085-1212TBWIG41-H12:
  // colstart=2, rowstart=1). The ST7789_2_Rotation.h CGRAM_OFFSET table has
  // been patched with a 128x128 entry, so setRotation() applies it.

  // For mirrored variants (values 4-7) we override MADCTL to toggle the MX
  // bit (column-address swap = horizontal mirror from the viewer's perspective
  // when the display is in portrait / MV=0).  The 8 values below cover all
  // MX/MY/MV combinations for a 128x128 square panel.
  if (displayRotation & 4) {
    tft.writecommand(TFT_MADCTL);
    switch (baseRot) {
      case 0: tft.writedata(TFT_MAD_MX | TFT_MAD_COLOR_ORDER);            break; // 0x48
      case 1: tft.writedata(TFT_MAD_MV | TFT_MAD_COLOR_ORDER);            break; // 0x28
      case 2: tft.writedata(TFT_MAD_MY | TFT_MAD_COLOR_ORDER);            break; // 0x88
      case 3: tft.writedata(TFT_MAD_MX | TFT_MAD_MY | TFT_MAD_MV |
                            TFT_MAD_COLOR_ORDER);                          break; // 0xE8
    }
  }
  Serial.printf("[display] rotation=%d (base=%d, mirror=%d)\n",
                displayRotation, baseRot, !!(displayRotation & 4));
}

void loadDisplayConfig() {
  if (!LittleFS.exists(DISPLAY_CONFIG_FILE)) return;
  File f = LittleFS.open(DISPLAY_CONFIG_FILE, "r");
  if (!f) return;
  int v = f.readStringUntil('\n').toInt();
  f.close();
  if (v >= 0 && v <= 7) displayRotation = v;
}

void saveDisplayConfig() {
  File f = LittleFS.open(DISPLAY_CONFIG_FILE, "w");
  if (!f) return;
  f.println(displayRotation);
  f.close();
}

// ---------- persistence for the bridge host ----------

void loadBridgeHost() {
  if (LittleFS.exists(WIFI_CONFIG_FILE)) {
    File f = LittleFS.open(WIFI_CONFIG_FILE, "r");
    bridgeHost = f.readStringUntil('\n');
    bridgeHost.trim();
    f.close();
  }
}

void saveBridgeHost(const String &host) {
  File f = LittleFS.open(WIFI_CONFIG_FILE, "w");
  f.println(host);
  f.close();
}

// ---------- custom sprite loading ----------

// Checks LittleFS for a previously-uploaded custom sprite and validates its
// size before trusting it (frame count byte + exact expected byte length).
void loadCustomSpriteState() {
  claudeCustom = false;
  if (LittleFS.exists(CLAUDE_SPRITE_FILE)) {
    File f = LittleFS.open(CLAUDE_SPRITE_FILE, "r");
    if (f && f.size() >= 1) {
      uint8_t cnt = f.read();
      size_t expected = 1 + (size_t)cnt * CLAUDE_FRAME_BYTES;
      if (cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        claudeCustom = true;
        claudeCustomFrames = cnt;
      }
    }
    if (f) f.close();
  }

