Magnetoresistance/esp8266-ai/firmware/src/main.cpp
void drawDotText(const String &s, int x, int y, int pitch, int r, uint16_t color) {
  for (unsigned int i = 0; i < s.length(); i++) {
    drawDotChar(s[i], x, y, pitch, r, color);
    x += dotCharAdv(s[i], pitch, r);
  }
}

void drawDotTextC(const String &s, int cx, int y, int pitch, int r, uint16_t color) {
  drawDotText(s, cx - dotTextWidth(s, pitch, r) / 2, y, pitch, r, color);
}

void drawDotTextR(const String &s, int xRight, int y, int pitch, int r, uint16_t color) {
  drawDotText(s, xRight - dotTextWidth(s, pitch, r), y, pitch, r, color);
}

String dotFitText(String s, int maxPx, int pitch, int r) {
  if (dotTextWidth(s, pitch, r) <= maxPx) return s;
  while (s.length() > 0 && dotTextWidth(s + "..", pitch, r) > maxPx) s.remove(s.length() - 1);
  return s + "..";
}

// Square-dot variant on the same 5x7 glyphs: d x d filled squares. With
// d == pitch the strokes fuse solid - bold mini caps to pair with the dotted
// numerals (Nothing does the same: dotted digits, solid small labels).
int sqCharAdv(char c, int pitch, int d) {
  const DotGlyph *g = dotGlyph(c);
  int w = g ? g->w : 3;
  return (w - 1) * pitch + d + pitch;
}

int sqTextWidth(const String &s, int pitch, int d) {
  if (s.length() == 0) return 0;
  int w = 0;
  for (unsigned int i = 0; i < s.length(); i++) w += sqCharAdv(s[i], pitch, d);
  return w - pitch;
}

void drawSqText(const String &s, int x, int y, int pitch, int d, uint16_t color) {
  for (unsigned int i = 0; i < s.length(); i++) {
    const DotGlyph *g = dotGlyph(s[i]);
    if (g)
      for (int ry = 0; ry < 7; ry++)
        for (int cx = 0; cx < g->w; cx++)
          if (g->rows[ry] & (1 << (g->w - 1 - cx)))
            tft.fillRect(x + cx * pitch, y + ry * pitch, d, d, color);
    x += sqCharAdv(s[i], pitch, d);
  }
}

void drawSqTextC(const String &s, int cx, int y, int pitch, int d, uint16_t color) {
  drawSqText(s, cx - sqTextWidth(s, pitch, d) / 2, y, pitch, d, color);
}

// Tiny-bold 3x5 caps (2x2 square dots): denser than the 5x7 face at the
// same height, used where a label must stay narrow but readable.
struct TinyGlyph {
  char c;
  uint8_t rows[5];
};

const TinyGlyph tinyGlyphs[] = {
    {'R', {0b110, 0b101, 0b110, 0b101, 0b101}},
    {'E', {0b111, 0b100, 0b110, 0b100, 0b111}},
    {'S', {0b011, 0b100, 0b010, 0b001, 0b110}},
    {'T', {0b111, 0b010, 0b010, 0b010, 0b010}},
};

void drawTinyBoldText(const String &s, int cx, int y, uint16_t color) {
  const int P = 2, D = 2;                                  // grid pitch / square dot size
  int x = cx - ((int)s.length() * (2 * P + D) + ((int)s.length() - 1) * 2) / 2;
  for (unsigned int i = 0; i < s.length(); i++) {
    for (const TinyGlyph &g : tinyGlyphs)
      if (g.c == s[i]) {
        for (int ry = 0; ry < 5; ry++)
          for (int gx = 0; gx < 3; gx++)
            if (g.rows[ry] & (0b100 >> gx)) tft.fillRect(x + gx * P, y + ry * P, D, D, color);
        break;
      }
    x += 2 * P + D + 2;
  }
}

void drawQuotaText(float hourPct, float weekPct, bool force) {
  // Codex dropped the 5h window (2026-07): the bridge then sends
  // primary_pct=null, so collapse to a single centered "Wk" column.
  bool single = hourPct < 0 && weekPct >= 0;
  static int8_t lastSingle = -1;
  if ((int8_t)single != lastSingle) {
    lastSingle = (int8_t)single;
    force = true;
    tft.fillRect(0, QUOTA_LABEL_Y, SCREEN_W, QUOTA_VALUE_Y + 15 - QUOTA_LABEL_Y, TFT_BLACK);
  }
  if (single) {
    if (force) drawSqTextC("Wk", SCREEN_CX, QUOTA_LABEL_Y, 1, 1, TFT_LIGHTGREY);
    String v = pctText(weekPct);
    if (force || v != lastQuotaWk) {
      lastQuotaWk = v;
      lastQuota5h = "";
      tft.fillRect(SCREEN_CX - 32, QUOTA_VALUE_Y, 64, 15, TFT_BLACK);
      drawDotTextC(v, SCREEN_CX, QUOTA_VALUE_Y, 2, 1, TFT_WHITE);
    }
    return;
  }
  if (force) {
    drawSqTextC("5h", QUOTA_COL1_X, QUOTA_LABEL_Y, 1, 1, TFT_LIGHTGREY);
    drawSqTextC("Wk", QUOTA_COL2_X, QUOTA_LABEL_Y, 1, 1, TFT_LIGHTGREY);
  }
  String v1 = pctText(hourPct), v2 = pctText(weekPct);
  if (force || v1 != lastQuota5h) {
    lastQuota5h = v1;
    tft.fillRect(QUOTA_COL1_X - 32, QUOTA_VALUE_Y, 64, 15, TFT_BLACK);
    drawDotTextC(v1, QUOTA_COL1_X, QUOTA_VALUE_Y, 2, 1, TFT_WHITE);
  }
  if (force || v2 != lastQuotaWk) {
    lastQuotaWk = v2;
    tft.fillRect(QUOTA_COL2_X - 32, QUOTA_VALUE_Y, 64, 15, TFT_BLACK);
    drawDotTextC(v2, QUOTA_COL2_X, QUOTA_VALUE_Y, 2, 1, TFT_WHITE);
  }
}

// ---------- quota-exhausted countdown ----------
// When the current app's 5h or weekly window is used up, the pet is replaced
// by a countdown to that window's reset (bridge sends minutes-until-reset).
// A spent weekly window blocks usage even after the 5h one resets, so the
// weekly countdown takes priority when both are exhausted.

enum CdType { CD_NONE, CD_5H, CD_WEEK };

float currentHourPct() {
  return currentApp == APP_CLAUDE ? claudeStatus.fiveHourPct : codexStatus.primaryPct;
}

int currentHourResetMin() {
  return currentApp == APP_CLAUDE ? claudeStatus.fiveHourResetMin : codexStatus.primaryResetMin;
}

float currentWeekPct() {
  return currentApp == APP_CLAUDE ? claudeStatus.sevenDayPct : codexStatus.weeklyPct;
}

int currentWeekResetMin() {
  return currentApp == APP_CLAUDE ? claudeStatus.sevenDayResetMin : codexStatus.weeklyResetMin;
}

CdType desiredCountdown() {
  if (currentWeekPct() >= 99.9f && currentWeekResetMin() >= 0) return CD_WEEK;
  if (currentHourPct() >= 99.9f && currentHourResetMin() >= 0) return CD_5H;
  return CD_NONE;
}

CdType showingCd = CD_NONE; // what's on screen now (vs desiredCountdown())
String lastCountdown;

// The bridge only reports whole minutes, so the seconds tick locally against
// a deadline anchored at millis(). Re-anchor only when the bridge disagrees
// by more than ~a minute (new window, big clock drift), otherwise a poll
// landing mid-minute would make the seconds jump around.
unsigned long cdDeadlineMs = 0; // 0 = not anchored
ActiveApp cdApp = APP_CLAUDE;   // which app/window the anchor belongs to
CdType cdAnchorType = CD_NONE;

