Magnetoresistance/esp8266-ai/firmware/src/main.cpp
void syncCountdownDeadline() {
  int m = showingCd == CD_WEEK ? currentWeekResetMin() : currentHourResetMin();
  if (m < 0) {
    cdDeadlineMs = 0;
    return;
  }
  long bridgeSec = (long)m * 60 + 30; // bridge floors to minutes: assume mid-minute
  long ourSec = (long)(cdDeadlineMs - millis()) / 1000;
  if (cdDeadlineMs == 0 || cdApp != currentApp || cdAnchorType != showingCd || ourSec < 0 ||
      labs(ourSec - bridgeSec) > 90) {
    cdDeadlineMs = millis() + (unsigned long)bridgeSec * 1000UL;
    cdApp = currentApp;
    cdAnchorType = showingCd;
  }
}

void drawCountdown(bool force) {
  long remain = cdDeadlineMs ? (long)(cdDeadlineMs - millis()) / 1000
                             : (long)(showingCd == CD_WEEK ? currentWeekResetMin() : currentHourResetMin()) * 60;
  if (remain < 0) remain = 0;
  char buf[16];
  long hours = remain / 3600;
  if (hours >= 100) // weekly can be up to 168h: h:mm:ss wouldn't fit the ring
    snprintf(buf, sizeof(buf), "%ld:%02ld", hours, (remain % 3600) / 60);
  else
    snprintf(buf, sizeof(buf), "%ld:%02ld:%02ld", hours, (remain % 3600) / 60, remain % 60);
  String t(buf);
  if (!force && t == lastCountdown) return;
  // A length change ("100:00" -> "99:59:59") shifts every glyph cell, so the
  // whole region must clear; otherwise same-length digits line up 1:1.
  if (t.length() != lastCountdown.length()) force = true;
  const int P = 3, R = 1, VAL_Y = 64; // countdown dot metrics (compact for 128px)
  int x = SCREEN_CX - dotTextWidth(t, P, R) / 2;
  if (force) {
    tft.fillRect(SCREEN_CX - 48, 40, 96, 56, TFT_BLACK);
    drawDotTextC(showingCd == CD_WEEK ? "Wk RESET IN" : "5h RESET IN", SCREEN_CX, 44, 1, 0,
                 TFT_LIGHTGREY);
    drawDotText(t, x, VAL_Y, P, R, TFT_ORANGE);
  } else {
    // Same length = identical cell layout: repaint only the digits that
    // changed, so the once-a-second tick never flashes the whole row.
    for (unsigned int i = 0; i < t.length(); i++) {
      int adv = dotCharAdv(t[i], P, R);
      if (t[i] != lastCountdown[i]) {
        tft.fillRect(x, VAL_Y, adv - P, dotTextHeight(P, R), TFT_BLACK);
        drawDotChar(t[i], x, VAL_Y, P, R, TFT_ORANGE);
      }
      x += adv;
    }
  }
  lastCountdown = t;
}

// App logo in the top-left corner (inside the quota ring) so a glance tells
// which app the screen is currently showing. Drawn row-by-row from PROGMEM
// through rowBuf, 2x downsampled to fit the 128px panel.
const int LOGO_X = 8, LOGO_Y = 10;

void drawAppLogo() {
  const uint16_t *logo = (currentApp == APP_CLAUDE) ? claude_logo_0 : codex_logo_0;
  int w = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_W : CODEX_LOGO_W;
  int h = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_H : CODEX_LOGO_H;
  const int S = 2;
  int dw = w / S, dh = h / S;
  for (int r = 0; r < dh; r++) {
    memcpy_P(rowBuf, logo + (size_t)(r * S) * w, (size_t)w * 2);
    for (int c = 0; c < dw; c++) rowBuf[c] = rowBuf[c * S];
    tft.pushImage(LOGO_X, LOGO_Y + r, dw, 1, rowBuf);
  }
}

// Days until the weekly window resets, top-right corner inside the ring
// (mirrors the app logo top-left). Weekly only - the 5h window is too short
// for a day count to say anything. Under a day it degrades to hours.
// Compact position for the 128px panel, clear of the ring edge.
const int RESET_CX = 112, RESET_LABEL_Y = 10, RESET_VALUE_Y = 24;
String lastResetDays;

String resetDaysText(int min) {
  if (min < 0) return "";
  if (min < 1440) return String((min + 59) / 60) + "h";
  return String((min + 1439) / 1440) + "d";
}

void drawResetDays(bool force) {
  String t = resetDaysText(currentWeekResetMin());
  if (!force && t == lastResetDays) return;
  lastResetDays = t;
  tft.fillRect(RESET_CX - 28, RESET_LABEL_Y, 52, RESET_VALUE_Y + 19 - RESET_LABEL_Y, TFT_BLACK);
  if (t.length() == 0) return;
  drawTinyBoldText("RESET", RESET_CX, RESET_LABEL_Y, TFT_LIGHTGREY);
  // 2 chars ("3d") get big 3px dots; 3 chars ("18h") drop a size to fit.
  int pitch = t.length() <= 2 ? 3 : 2;
  drawDotTextC(t, RESET_CX, RESET_VALUE_Y, pitch, 1, TFT_WHITE);
}

// Codex's ring percentage: the 5h window when it exists, otherwise the
// weekly one (Codex removed the 5h limit in 2026-07).
float codexRingPct() {
  if (codexStatus.primaryPct >= 0) return codexStatus.primaryPct;
  return max(codexStatus.weeklyPct, 0.0f);
}

// Claude's ring percentage: real 5h OAuth quota from the bridge when known,
// otherwise fall back to elapsed session time as a rough stand-in.
float claudeRingPct() {
  if (claudeStatus.fiveHourPct >= 0) return claudeStatus.fiveHourPct;
  return claudeStatus.sessionWindowMin > 0
             ? (100.0 * claudeStatus.sessionMin / claudeStatus.sessionWindowMin)
             : 0;
}

// Redraws whichever app is currently active, full screen: quota ring +
// sprite (or the reset countdown while the 5h window is exhausted).
// Full clear + repaint - only for real transitions (app switch, mode return,
// sprite change); steady-state data updates go through refreshActiveApp().
void drawActiveApp() {
  tft.fillScreen(TFT_BLACK);
  ringLastPct = -1000; // screen was cleared: force the ring repaint
  showingCd = desiredCountdown();
  if (showingCd != CD_NONE) syncCountdownDeadline();
  else cdDeadlineMs = 0;
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
    if (showingCd == CD_NONE) drawClaudeSprite(claudeFrame);
    drawQuotaText(claudeRingPct(), claudeStatus.sevenDayPct, true);
  } else {
    drawSquareRing(codexRingPct(), currentStatusColor());
    if (showingCd == CD_NONE) drawCodexSprite(codexFrame);
    drawQuotaText(codexStatus.primaryPct, codexStatus.weeklyPct, true);
  }
  if (showingCd != CD_NONE) drawCountdown(true);
  drawAppLogo();
  drawResetDays(true);
}

// In-place refresh after a bridge poll: ring repaint + only the text that
// actually changed. No fillScreen, so the 5s poll doesn't blank the screen.
void refreshActiveApp() {
  if (desiredCountdown() != showingCd) { // pet <-> countdown (or 5h <-> weekly) swap
    drawActiveApp();
    return;
  }
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
    drawQuotaText(claudeRingPct(), claudeStatus.sevenDayPct, false);
  } else {
    drawSquareRing(codexRingPct(), currentStatusColor());
    drawQuotaText(codexStatus.primaryPct, codexStatus.weeklyPct, false);
  }
  drawResetDays(false);
  if (showingCd != CD_NONE) {
    syncCountdownDeadline();
    drawCountdown(false);
  }
}

// Redraws just the ring (cheap) - used for status color animation ticks
// between full redraws.
void redrawRingOnly() {
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
  } else {
    drawSquareRing(codexRingPct(), currentStatusColor());
  }
}

// Who gets the screen:
//   - display mode pinned (Mac app) -> that app, always
//   - exactly one app working       -> that app, immediately
//   - both working                  -> alternate every SWITCH_BOTH_MS (2s)
//   - neither working               -> alternate slowly (SWITCH_IDLE_MS)
bool updateActiveApp() {
  ActiveApp desired = currentApp;

  if (displayMode == MODE_CLAUDE) {
    desired = APP_CLAUDE;
  } else if (displayMode == MODE_CODEX) {
    desired = APP_CODEX;
  } else if (claudeStatus.needsInput && !codexStatus.needsInput) {
    desired = APP_CLAUDE; // approval prompt wins the screen
  } else if (codexStatus.needsInput && !claudeStatus.needsInput) {
    desired = APP_CODEX;
  } else {
    bool claudeWorking = claudeStatus.status == "working";
    bool codexWorking = codexStatus.status == "working";
    if (claudeWorking && !codexWorking) {
      desired = APP_CLAUDE;
    } else if (codexWorking && !claudeWorking) {
      desired = APP_CODEX;
    } else {
      unsigned long interval = (claudeWorking && codexWorking) ? SWITCH_BOTH_MS : SWITCH_IDLE_MS;
      if (millis() - lastSwitchMs >= interval) {
        lastSwitchMs = millis();
        desired = (currentApp == APP_CLAUDE) ? APP_CODEX : APP_CLAUDE;
      }
    }
  }

