Magnetoresistance/esp8266-ai/firmware/src/main.cpp
// ---------- screen mirror ----------
// The bridge scales the Mac/PC desktop (or a chosen window) down to the
// panel size and serves each frame as raw RGB565 via GET /mirror/raw. We
// fetch one frame per interval and stream it row-by-row straight to the
// panel (rowBuf scratch row, no full-frame buffer), byte order matching the
// pushImage() pipeline used by the sprite/cover code.
const unsigned long MIRROR_POLL_INTERVAL_MS = 500; // ~2 fps over LAN
const unsigned long MIRROR_HTTP_TIMEOUT_MS = 1500;

void pollMirror() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/mirror/raw";
  http.setTimeout(MIRROR_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) {
    WiFiClient *stream = http.getStreamPtr();
    const size_t rowBytes = (size_t)SCREEN_W * 2;
    bool ok = true;
    for (int r = 0; r < SCREEN_H && ok; r++) {
      if (stream->readBytes((uint8_t *)rowBuf, rowBytes) != (int)rowBytes) {
        ok = false;
        break;
      }
      tft.pushImage(0, r, SCREEN_W, 1, rowBuf);
      yield();
    }
  }
  http.end();
}

// ---------- photo album ----------
// The bridge serves a photo list via GET /album/list (JSON {"count":N}) and
// the current resized 128x128 RGB565 photo via GET /album/raw. The bridge
// advances to the next photo on each /album/raw request, so we just poll it
// once per ALBUM_POLL_INTERVAL_MS and stream the frame row-by-row exactly
// like the mirror path (no idx needed on the wire).
const unsigned long ALBUM_POLL_INTERVAL_MS = 4000; // one slide per ~4s
const unsigned long ALBUM_HTTP_TIMEOUT_MS = 2000;

void pollAlbum() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/album/raw";
  http.setTimeout(ALBUM_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) {
    WiFiClient *stream = http.getStreamPtr();
    const size_t rowBytes = (size_t)SCREEN_W * 2;
    bool ok = true;
    for (int r = 0; r < SCREEN_H && ok; r++) {
      if (stream->readBytes((uint8_t *)rowBuf, rowBytes) != (int)rowBytes) {
        ok = false;
        break;
      }
      tft.pushImage(0, r, SCREEN_W, 1, rowBuf);
      yield();
    }
  }
  http.end();
}

// ---------- stock watchlist screen ----------

bool handleStockPayload(const String &payload) {
  JsonDocument doc;
  if (deserializeJson(doc, payload)) return false;
  JsonArray arr = doc["stocks"];
  stockCount = 0;
  for (JsonObject s : arr) {
    if (stockCount >= MAX_STOCKS) break;
    stocks[stockCount].code = s["code"] | "";
    stocks[stockCount].price = s["price"] | "";
    stocks[stockCount].pct = s["pct"] | "";
    stocks[stockCount].up = s["up"] | 0;
    stockCount++;
  }
  stockNamesRev = doc["names_rev"] | -1;
  stockEverLoaded = true;
  stockDirty = true;
  return true;
}

// Streams the Mac-rendered name strips and blits one per row (top line,
// right of the ASCII code). Wired-only mode has no HTTP: codes still show.
bool drawStockNames() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/stock/names.raw";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return false;
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    http.end();
    return false;
  }
  WiFiClient *stream = http.getStreamPtr();
  uint8_t cnt = 0;
  if (stream->readBytes(&cnt, 1) != 1) {
    http.end();
    return false;
  }
  const size_t rowBytes = (size_t)STOCK_NAME_W * 2;
  bool ok = true;
  // 2x downsample for the 128px panel: read a full 156px strip row, keep
  // every other pixel (78px wide); display every other row (8px tall).
  for (int i = 0; i < cnt && ok; i++) {
    int y0 = 4 + i * 26;
    for (int r = 0; r < STOCK_NAME_H / 2; r++) {
      for (int skip = 0; skip < 2; skip++) {
        if (stream->readBytes((uint8_t *)rowBuf, rowBytes) != (int)rowBytes) {
          ok = false;
          break;
        }
        if (skip == 0) {
          for (int c = 0; c < STOCK_NAME_W / 2; c++) rowBuf[c] = rowBuf[c * 2];
          if (i < stockCount) tft.pushImage(48, y0 + r, STOCK_NAME_W / 2, 1, rowBuf);
        }
      }
      yield();
    }
  }
  http.end();
  return ok;
}

void pollStock() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/stock";
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == HTTP_CODE_OK) handleStockPayload(http.getString());
  http.end();
}

// 26px per row (compact for 128px panel): small grey code on top, font-2
// price (white) on the left and change% on the right - red rising / green
// falling (CN convention). Rows repaint only when their text changes.
void drawStockScreen() {
  if (!stockChromeDrawn) {
    tft.fillScreen(TFT_BLACK);
    stockChromeDrawn = true;
    for (int i = 0; i < MAX_STOCKS; i++) {
      stockLastCode[i] = "\x01"; // force repaint
      stockLastVal[i] = "\x01";
    }
    stockNamesDrawnRev = -1;
    tft.setTextDatum(TC_DATUM);
    tft.setTextColor(0x7BEF, TFT_BLACK);
    tft.drawString("STOCKS", SCREEN_CX, 118, 1);
  }
  stockDirty = false;

  if (stockCount == 0) {
    if (stockLastCode[0] != "") {
      for (int i = 0; i < MAX_STOCKS; i++) {
        stockLastCode[i] = "";
        stockLastVal[i] = "";
      }
      tft.fillRect(0, 0, SCREEN_W, 116, TFT_BLACK);
      tft.setTextDatum(TC_DATUM);
      tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      tft.drawString(stockEverLoaded ? "No stocks configured" : "Waiting for bridge...", SCREEN_CX, 56, 2);
      if (stockEverLoaded) tft.drawString("Mac menu: Set watchlist", SCREEN_CX, 74, 1);
    }
    return;
  }

  for (int i = 0; i < MAX_STOCKS; i++) {
    int y0 = 4 + i * 26;
    bool has = i < stockCount;
    // top line (code + name strip) and value line refresh independently, so
    // a price tick never wipes the name bitmap
    String codeKey = has ? stocks[i].code : "";
    if (codeKey != stockLastCode[i]) {
      stockLastCode[i] = codeKey;
      tft.fillRect(0, y0, SCREEN_W, 12, TFT_BLACK);
      stockNamesDrawnRev = -1; // strip area wiped: re-fetch names
      if (has) {
        tft.setTextDatum(TL_DATUM);
        tft.setTextColor(0x7BEF, TFT_BLACK);
        tft.drawString(stocks[i].code, 6, y0, 1);
      }
    }
    String valKey = has ? stocks[i].price + "|" + stocks[i].pct + "|" + String(stocks[i].up) : "";
    if (valKey != stockLastVal[i]) {
      stockLastVal[i] = valKey;
      tft.fillRect(0, y0 + 12, SCREEN_W, 14, TFT_BLACK); // value line + inter-row gap
      if (has) {
        tft.setTextDatum(TL_DATUM);
        tft.setTextColor(TFT_WHITE, TFT_BLACK);
        tft.drawString(stocks[i].price, 6, y0 + 12, 2);
        uint16_t pc = stocks[i].up > 0 ? TFT_RED : (stocks[i].up < 0 ? TFT_GREEN : TFT_LIGHTGREY);
        tft.setTextDatum(TR_DATUM);
        tft.setTextColor(pc, TFT_BLACK);
        tft.drawString(stocks[i].pct, 124, y0 + 12, 2);
      }
    }
  }

  // CJK name strips, re-fetched when the watchlist (names_rev) changes
  if (stockNamesRev >= 0 && stockNamesDrawnRev != stockNamesRev) {
    if (drawStockNames()) stockNamesDrawnRev = stockNamesRev;
  }
}

